Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13145.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x09A);
#ifndef _LIB_BUILD
asm("PIE4 equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned CLC1IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned CLC3IE                 :1;
        unsigned CLC4IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x09A);
// bitfield macros
#define _PIE4_CLC1IE_POSN                                   0x2
#define _PIE4_CLC1IE_POSITION                               0x2
#define _PIE4_CLC1IE_SIZE                                   0x1
#define _PIE4_CLC1IE_LENGTH                                 0x1
#define _PIE4_CLC1IE_MASK                                   0x4
#define _PIE4_CLC2IE_POSN                                   0x3
#define _PIE4_CLC2IE_POSITION                               0x3
#define _PIE4_CLC2IE_SIZE                                   0x1
#define _PIE4_CLC2IE_LENGTH                                 0x1
#define _PIE4_CLC2IE_MASK                                   0x8
#define _PIE4_CLC3IE_POSN                                   0x4
#define _PIE4_CLC3IE_POSITION                               0x4
#define _PIE4_CLC3IE_SIZE                                   0x1
#define _PIE4_CLC3IE_LENGTH                                 0x1
#define _PIE4_CLC3IE_MASK                                   0x10
#define _PIE4_CLC4IE_POSN                                   0x5
#define _PIE4_CLC4IE_POSITION                               0x5
#define _PIE4_CLC4IE_SIZE                                   0x1
#define _PIE4_CLC4IE_LENGTH                                 0x1
#define _PIE4_CLC4IE_MASK                                   0x20
#define _PIE4_TX1IE_POSN                                    0x6
#define _PIE4_TX1IE_POSITION                                0x6
#define _PIE4_TX1IE_SIZE                                    0x1
#define _PIE4_TX1IE_LENGTH                                  0x1
#define _PIE4_TX1IE_MASK                                    0x40
#define _PIE4_RC1IE_POSN                                    0x7
#define _PIE4_RC1IE_POSITION                                0x7
#define _PIE4_RC1IE_SIZE                                    0x1
#define _PIE4_RC1IE_LENGTH                                  0x1
#define _PIE4_RC1IE_MASK                                    0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x09B);
#ifndef _LIB_BUILD
asm("PIE5 equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned                        :2;
        unsigned CM1IE                  :1;
        unsigned CM2IE                  :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x09B);
// bitfield macros
#define _PIE5_SSP1IE_POSN                                   0x2
#define _PIE5_SSP1IE_POSITION                               0x2
#define _PIE5_SSP1IE_SIZE                                   0x1
#define _PIE5_SSP1IE_LENGTH                                 0x1
#define _PIE5_SSP1IE_MASK                                   0x4
#define _PIE5_BCL1IE_POSN                                   0x3
#define _PIE5_BCL1IE_POSITION                               0x3
#define _PIE5_BCL1IE_SIZE                                   0x1
#define _PIE5_BCL1IE_LENGTH                                 0x1
#define _PIE5_BCL1IE_MASK                                   0x8
#define _PIE5_CM1IE_POSN                                    0x6
#define _PIE5_CM1IE_POSITION                                0x6
#define _PIE5_CM1IE_SIZE                                    0x1
#define _PIE5_CM1IE_LENGTH                                  0x1
#define _PIE5_CM1IE_MASK                                    0x40
#define _PIE5_CM2IE_POSN                                    0x7
#define _PIE5_CM2IE_POSITION                                0x7
#define _PIE5_CM2IE_SIZE                                    0x1
#define _PIE5_CM2IE_LENGTH                                  0x1
#define _PIE5_CM2IE_MASK                                    0x80

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x09C);
#ifndef _LIB_BUILD
asm("PIE6 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x09C);
// bitfield macros
#define _PIE6_ADIE_POSN                                     0x0
#define _PIE6_ADIE_POSITION                                 0x0
#define _PIE6_ADIE_SIZE                                     0x1
#define _PIE6_ADIE_LENGTH                                   0x1
#define _PIE6_ADIE_MASK                                     0x1
#define _PIE6_ADTIE_POSN                                    0x1
#define _PIE6_ADTIE_POSITION                                0x1
#define _PIE6_ADTIE_SIZE                                    0x1
#define _PIE6_ADTIE_LENGTH                                  0x1
#define _PIE6_ADTIE_MASK                                    0x2

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x09D);
#ifndef _LIB_BUILD
asm("PIE7 equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLB1IE0                :1;
        unsigned CLB1IE1                :1;
        unsigned CLB1IE2                :1;
        unsigned CLB1IE3                :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x09D);
// bitfield macros
#define _PIE7_CLB1IE0_POSN                                  0x0
#define _PIE7_CLB1IE0_POSITION                              0x0
#define _PIE7_CLB1IE0_SIZE                                  0x1
#define _PIE7_CLB1IE0_LENGTH                                0x1
#define _PIE7_CLB1IE0_MASK                                  0x1
#define _PIE7_CLB1IE1_POSN                                  0x1
#define _PIE7_CLB1IE1_POSITION                              0x1
#define _PIE7_CLB1IE1_SIZE                                  0x1
#define _PIE7_CLB1IE1_LENGTH                                0x1
#define _PIE7_CLB1IE1_MASK                                  0x2
#define _PIE7_CLB1IE2_POSN                                  0x2
#define _PIE7_CLB1IE2_POSITION                              0x2
#define _PIE7_CLB1IE2_SIZE                                  0x1
#define _PIE7_CLB1IE2_LENGTH                                0x1
#define _PIE7_CLB1IE2_MASK                                  0x4
#define _PIE7_CLB1IE3_POSN                                  0x3
#define _PIE7_CLB1IE3_POSITION                              0x3
#define _PIE7_CLB1IE3_SIZE                                  0x1
#define _PIE7_CLB1IE3_LENGTH                                0x1
#define _PIE7_CLB1IE3_MASK                                  0x8

