Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13145.h
// Register: CCP2CAP
#define CCP2CAP CCP2CAP
extern volatile unsigned char           CCP2CAP             __at(0x413);
#ifndef _LIB_BUILD
asm("CCP2CAP equ 0413h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :6;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
    };
    struct {
        unsigned CCP2CTS                :6;
    };
    struct {
        unsigned CCP2CTS0               :1;
        unsigned CCP2CTS1               :1;
        unsigned CCP2CTS2               :1;
        unsigned CCP2CTS3               :1;
    };
} CCP2CAPbits_t;
extern volatile CCP2CAPbits_t CCP2CAPbits __at(0x413);
// bitfield macros
#define _CCP2CAP_CTS_POSN                                   0x0
#define _CCP2CAP_CTS_POSITION                               0x0
#define _CCP2CAP_CTS_SIZE                                   0x6
#define _CCP2CAP_CTS_LENGTH                                 0x6
#define _CCP2CAP_CTS_MASK                                   0x3F
#define _CCP2CAP_CTS0_POSN                                  0x0
#define _CCP2CAP_CTS0_POSITION                              0x0
#define _CCP2CAP_CTS0_SIZE                                  0x1
#define _CCP2CAP_CTS0_LENGTH                                0x1
#define _CCP2CAP_CTS0_MASK                                  0x1
#define _CCP2CAP_CTS1_POSN                                  0x1
#define _CCP2CAP_CTS1_POSITION                              0x1
#define _CCP2CAP_CTS1_SIZE                                  0x1
#define _CCP2CAP_CTS1_LENGTH                                0x1
#define _CCP2CAP_CTS1_MASK                                  0x2
#define _CCP2CAP_CTS2_POSN                                  0x2
#define _CCP2CAP_CTS2_POSITION                              0x2
#define _CCP2CAP_CTS2_SIZE                                  0x1
#define _CCP2CAP_CTS2_LENGTH                                0x1
#define _CCP2CAP_CTS2_MASK                                  0x4
#define _CCP2CAP_CTS3_POSN                                  0x3
#define _CCP2CAP_CTS3_POSITION                              0x3
#define _CCP2CAP_CTS3_SIZE                                  0x1
#define _CCP2CAP_CTS3_LENGTH                                0x1
#define _CCP2CAP_CTS3_MASK                                  0x8
#define _CCP2CAP_CCP2CTS_POSN                               0x0
#define _CCP2CAP_CCP2CTS_POSITION                           0x0
#define _CCP2CAP_CCP2CTS_SIZE                               0x6
#define _CCP2CAP_CCP2CTS_LENGTH                             0x6
#define _CCP2CAP_CCP2CTS_MASK                               0x3F
#define _CCP2CAP_CCP2CTS0_POSN                              0x0
#define _CCP2CAP_CCP2CTS0_POSITION                          0x0
#define _CCP2CAP_CCP2CTS0_SIZE                              0x1
#define _CCP2CAP_CCP2CTS0_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS0_MASK                              0x1
#define _CCP2CAP_CCP2CTS1_POSN                              0x1
#define _CCP2CAP_CCP2CTS1_POSITION                          0x1
#define _CCP2CAP_CCP2CTS1_SIZE                              0x1
#define _CCP2CAP_CCP2CTS1_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS1_MASK                              0x2
#define _CCP2CAP_CCP2CTS2_POSN                              0x2
#define _CCP2CAP_CCP2CTS2_POSITION                          0x2
#define _CCP2CAP_CCP2CTS2_SIZE                              0x1
#define _CCP2CAP_CCP2CTS2_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS2_MASK                              0x4
#define _CCP2CAP_CCP2CTS3_POSN                              0x3
#define _CCP2CAP_CCP2CTS3_POSITION                          0x3
#define _CCP2CAP_CCP2CTS3_SIZE                              0x1
#define _CCP2CAP_CCP2CTS3_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS3_MASK                              0x8

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
extern volatile unsigned char           CCPTMRS0            __at(0x41F);
#ifndef _LIB_BUILD
asm("CCPTMRS0 equ 041Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :2;
        unsigned C2TSEL                 :2;
    };
} CCPTMRS0bits_t;
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0x41F);
// bitfield macros
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x2
#define _CCPTMRS0_C1TSEL_LENGTH                             0x2
#define _CCPTMRS0_C1TSEL_MASK                               0x3
#define _CCPTMRS0_C2TSEL_POSN                               0x2
#define _CCPTMRS0_C2TSEL_POSITION                           0x2
#define _CCPTMRS0_C2TSEL_SIZE                               0x2
#define _CCPTMRS0_C2TSEL_LENGTH                             0x2
#define _CCPTMRS0_C2TSEL_MASK                               0xC

// Register: CLBCON
#define CLBCON CLBCON
extern volatile unsigned char           CLBCON              __at(0x50C);
#ifndef _LIB_BUILD
asm("CLBCON equ 050Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUSY                   :1;
        unsigned RDHOLD                 :1;
        unsigned                        :5;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :7;
        unsigned CLBEN                  :1;
    };
} CLBCONbits_t;
extern volatile CLBCONbits_t CLBCONbits __at(0x50C);
// bitfield macros
#define _CLBCON_BUSY_POSN                                   0x0
#define _CLBCON_BUSY_POSITION                               0x0
#define _CLBCON_BUSY_SIZE                                   0x1
#define _CLBCON_BUSY_LENGTH                                 0x1
#define _CLBCON_BUSY_MASK                                   0x1
#define _CLBCON_RDHOLD_POSN                                 0x1
#define _CLBCON_RDHOLD_POSITION                             0x1
#define _CLBCON_RDHOLD_SIZE                                 0x1
#define _CLBCON_RDHOLD_LENGTH                               0x1
#define _CLBCON_RDHOLD_MASK                                 0x2
#define _CLBCON_EN_POSN                                     0x7
#define _CLBCON_EN_POSITION                                 0x7
#define _CLBCON_EN_SIZE                                     0x1
#define _CLBCON_EN_LENGTH                                   0x1
#define _CLBCON_EN_MASK                                     0x80
#define _CLBCON_CLBEN_POSN                                  0x7
#define _CLBCON_CLBEN_POSITION                              0x7
#define _CLBCON_CLBEN_SIZE                                  0x1
#define _CLBCON_CLBEN_LENGTH                                0x1
#define _CLBCON_CLBEN_MASK                                  0x80

// Register: CLBSWINU
#define CLBSWINU CLBSWINU
extern volatile unsigned char           CLBSWINU            __at(0x50D);
#ifndef _LIB_BUILD
asm("CLBSWINU equ 050Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWINU               :8;
    };
    struct {
        unsigned CLBSWIN24              :1;
        unsigned CLBSWIN25              :1;
        unsigned CLBSWIN26              :1;
        unsigned CLBSWIN27              :1;
        unsigned CLBSWIN28              :1;
        unsigned CLBSWIN29              :1;
        unsigned CLBSWIN30              :1;
        unsigned CLBSWIN31              :1;
    };
} CLBSWINUbits_t;
extern volatile CLBSWINUbits_t CLBSWINUbits __at(0x50D);
// bitfield macros
#define _CLBSWINU_CLBSWINU_POSN                             0x0
#define _CLBSWINU_CLBSWINU_POSITION                         0x0
#define _CLBSWINU_CLBSWINU_SIZE                             0x8
#define _CLBSWINU_CLBSWINU_LENGTH                           0x8
#define _CLBSWINU_CLBSWINU_MASK                             0xFF
#define _CLBSWINU_CLBSWIN24_POSN                            0x0
#define _CLBSWINU_CLBSWIN24_POSITION                        0x0
#define _CLBSWINU_CLBSWIN24_SIZE                            0x1
#define _CLBSWINU_CLBSWIN24_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN24_MASK                            0x1
#define _CLBSWINU_CLBSWIN25_POSN                            0x1
#define _CLBSWINU_CLBSWIN25_POSITION                        0x1
#define _CLBSWINU_CLBSWIN25_SIZE                            0x1
#define _CLBSWINU_CLBSWIN25_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN25_MASK                            0x2
#define _CLBSWINU_CLBSWIN26_POSN                            0x2
#define _CLBSWINU_CLBSWIN26_POSITION                        0x2
#define _CLBSWINU_CLBSWIN26_SIZE                            0x1
#define _CLBSWINU_CLBSWIN26_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN26_MASK                            0x4
#define _CLBSWINU_CLBSWIN27_POSN                            0x3
#define _CLBSWINU_CLBSWIN27_POSITION                        0x3
#define _CLBSWINU_CLBSWIN27_SIZE                            0x1
#define _CLBSWINU_CLBSWIN27_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN27_MASK                            0x8
#define _CLBSWINU_CLBSWIN28_POSN                            0x4
#define _CLBSWINU_CLBSWIN28_POSITION                        0x4
#define _CLBSWINU_CLBSWIN28_SIZE                            0x1
#define _CLBSWINU_CLBSWIN28_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN28_MASK                            0x10
#define _CLBSWINU_CLBSWIN29_POSN                            0x5
#define _CLBSWINU_CLBSWIN29_POSITION                        0x5
#define _CLBSWINU_CLBSWIN29_SIZE                            0x1
#define _CLBSWINU_CLBSWIN29_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN29_MASK                            0x20
#define _CLBSWINU_CLBSWIN30_POSN                            0x6
#define _CLBSWINU_CLBSWIN30_POSITION                        0x6
#define _CLBSWINU_CLBSWIN30_SIZE                            0x1
#define _CLBSWINU_CLBSWIN30_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN30_MASK                            0x40
#define _CLBSWINU_CLBSWIN31_POSN                            0x7
#define _CLBSWINU_CLBSWIN31_POSITION                        0x7
#define _CLBSWINU_CLBSWIN31_SIZE                            0x1
#define _CLBSWINU_CLBSWIN31_LENGTH                          0x1
#define _CLBSWINU_CLBSWIN31_MASK                            0x80

// Register: CLBSWINH
#define CLBSWINH CLBSWINH
extern volatile unsigned char           CLBSWINH            __at(0x50E);
#ifndef _LIB_BUILD
asm("CLBSWINH equ 050Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWINH               :8;
    };
    struct {
        unsigned CLBSWIN16              :1;
        unsigned CLBSWIN17              :1;
        unsigned CLBSWIN18              :1;
        unsigned CLBSWIN19              :1;
        unsigned CLBSWIN20              :1;
        unsigned CLBSWIN21              :1;
        unsigned CLBSWIN22              :1;
        unsigned CLBSWIN23              :1;
    };
} CLBSWINHbits_t;
extern volatile CLBSWINHbits_t CLBSWINHbits __at(0x50E);
// bitfield macros
#define _CLBSWINH_CLBSWINH_POSN                             0x0
#define _CLBSWINH_CLBSWINH_POSITION                         0x0
#define _CLBSWINH_CLBSWINH_SIZE                             0x8
#define _CLBSWINH_CLBSWINH_LENGTH                           0x8
#define _CLBSWINH_CLBSWINH_MASK                             0xFF
#define _CLBSWINH_CLBSWIN16_POSN                            0x0
#define _CLBSWINH_CLBSWIN16_POSITION                        0x0
#define _CLBSWINH_CLBSWIN16_SIZE                            0x1
#define _CLBSWINH_CLBSWIN16_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN16_MASK                            0x1
#define _CLBSWINH_CLBSWIN17_POSN                            0x1
#define _CLBSWINH_CLBSWIN17_POSITION                        0x1
#define _CLBSWINH_CLBSWIN17_SIZE                            0x1
#define _CLBSWINH_CLBSWIN17_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN17_MASK                            0x2
#define _CLBSWINH_CLBSWIN18_POSN                            0x2
#define _CLBSWINH_CLBSWIN18_POSITION                        0x2
#define _CLBSWINH_CLBSWIN18_SIZE                            0x1
#define _CLBSWINH_CLBSWIN18_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN18_MASK                            0x4
#define _CLBSWINH_CLBSWIN19_POSN                            0x3
#define _CLBSWINH_CLBSWIN19_POSITION                        0x3
#define _CLBSWINH_CLBSWIN19_SIZE                            0x1
#define _CLBSWINH_CLBSWIN19_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN19_MASK                            0x8
#define _CLBSWINH_CLBSWIN20_POSN                            0x4
#define _CLBSWINH_CLBSWIN20_POSITION                        0x4
#define _CLBSWINH_CLBSWIN20_SIZE                            0x1
#define _CLBSWINH_CLBSWIN20_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN20_MASK                            0x10
#define _CLBSWINH_CLBSWIN21_POSN                            0x5
#define _CLBSWINH_CLBSWIN21_POSITION                        0x5
#define _CLBSWINH_CLBSWIN21_SIZE                            0x1
#define _CLBSWINH_CLBSWIN21_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN21_MASK                            0x20
#define _CLBSWINH_CLBSWIN22_POSN                            0x6
#define _CLBSWINH_CLBSWIN22_POSITION                        0x6
#define _CLBSWINH_CLBSWIN22_SIZE                            0x1
#define _CLBSWINH_CLBSWIN22_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN22_MASK                            0x40
#define _CLBSWINH_CLBSWIN23_POSN                            0x7
#define _CLBSWINH_CLBSWIN23_POSITION                        0x7
#define _CLBSWINH_CLBSWIN23_SIZE                            0x1
#define _CLBSWINH_CLBSWIN23_LENGTH                          0x1
#define _CLBSWINH_CLBSWIN23_MASK                            0x80

// Register: CLBSWINM
#define CLBSWINM CLBSWINM
extern volatile unsigned char           CLBSWINM            __at(0x50F);
#ifndef _LIB_BUILD
asm("CLBSWINM equ 050Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWINM               :8;
    };
    struct {
        unsigned CLBSWIN8               :1;
        unsigned CLBSWIN9               :1;
        unsigned CLBSWIN10              :1;
        unsigned CLBSWIN11              :1;
        unsigned CLBSWIN12              :1;
        unsigned CLBSWIN13              :1;
        unsigned CLBSWIN14              :1;
        unsigned CLBSWIN15              :1;
    };
} CLBSWINMbits_t;
extern volatile CLBSWINMbits_t CLBSWINMbits __at(0x50F);
// bitfield macros
#define _CLBSWINM_CLBSWINM_POSN                             0x0
#define _CLBSWINM_CLBSWINM_POSITION                         0x0
#define _CLBSWINM_CLBSWINM_SIZE                             0x8
#define _CLBSWINM_CLBSWINM_LENGTH                           0x8
#define _CLBSWINM_CLBSWINM_MASK                             0xFF
#define _CLBSWINM_CLBSWIN8_POSN                             0x0
#define _CLBSWINM_CLBSWIN8_POSITION                         0x0
#define _CLBSWINM_CLBSWIN8_SIZE                             0x1
#define _CLBSWINM_CLBSWIN8_LENGTH                           0x1
#define _CLBSWINM_CLBSWIN8_MASK                             0x1
#define _CLBSWINM_CLBSWIN9_POSN                             0x1
#define _CLBSWINM_CLBSWIN9_POSITION                         0x1
#define _CLBSWINM_CLBSWIN9_SIZE                             0x1
#define _CLBSWINM_CLBSWIN9_LENGTH                           0x1
#define _CLBSWINM_CLBSWIN9_MASK                             0x2
#define _CLBSWINM_CLBSWIN10_POSN                            0x2
#define _CLBSWINM_CLBSWIN10_POSITION                        0x2
#define _CLBSWINM_CLBSWIN10_SIZE                            0x1
#define _CLBSWINM_CLBSWIN10_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN10_MASK                            0x4
#define _CLBSWINM_CLBSWIN11_POSN                            0x3
#define _CLBSWINM_CLBSWIN11_POSITION                        0x3
#define _CLBSWINM_CLBSWIN11_SIZE                            0x1
#define _CLBSWINM_CLBSWIN11_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN11_MASK                            0x8
#define _CLBSWINM_CLBSWIN12_POSN                            0x4
#define _CLBSWINM_CLBSWIN12_POSITION                        0x4
#define _CLBSWINM_CLBSWIN12_SIZE                            0x1
#define _CLBSWINM_CLBSWIN12_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN12_MASK                            0x10
#define _CLBSWINM_CLBSWIN13_POSN                            0x5
#define _CLBSWINM_CLBSWIN13_POSITION                        0x5
#define _CLBSWINM_CLBSWIN13_SIZE                            0x1
#define _CLBSWINM_CLBSWIN13_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN13_MASK                            0x20
#define _CLBSWINM_CLBSWIN14_POSN                            0x6
#define _CLBSWINM_CLBSWIN14_POSITION                        0x6
#define _CLBSWINM_CLBSWIN14_SIZE                            0x1
#define _CLBSWINM_CLBSWIN14_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN14_MASK                            0x40
#define _CLBSWINM_CLBSWIN15_POSN                            0x7
#define _CLBSWINM_CLBSWIN15_POSITION                        0x7
#define _CLBSWINM_CLBSWIN15_SIZE                            0x1
#define _CLBSWINM_CLBSWIN15_LENGTH                          0x1
#define _CLBSWINM_CLBSWIN15_MASK                            0x80

// Register: CLBSWINL
#define CLBSWINL CLBSWINL
extern volatile unsigned char           CLBSWINL            __at(0x510);
#ifndef _LIB_BUILD
asm("CLBSWINL equ 0510h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWINL               :8;
    };
    struct {
        unsigned CLBSWIN0               :1;
        unsigned CLBSWIN1               :1;
        unsigned CLBSWIN2               :1;
        unsigned CLBSWIN3               :1;
        unsigned CLBSWIN4               :1;
        unsigned CLBSWIN5               :1;
        unsigned CLBSWIN6               :1;
        unsigned CLBSWIN7               :1;
    };
} CLBSWINLbits_t;
extern volatile CLBSWINLbits_t CLBSWINLbits __at(0x510);
// bitfield macros
#define _CLBSWINL_CLBSWINL_POSN                             0x0
#define _CLBSWINL_CLBSWINL_POSITION                         0x0
#define _CLBSWINL_CLBSWINL_SIZE                             0x8
#define _CLBSWINL_CLBSWINL_LENGTH                           0x8
#define _CLBSWINL_CLBSWINL_MASK                             0xFF
#define _CLBSWINL_CLBSWIN0_POSN                             0x0
#define _CLBSWINL_CLBSWIN0_POSITION                         0x0
#define _CLBSWINL_CLBSWIN0_SIZE                             0x1
#define _CLBSWINL_CLBSWIN0_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN0_MASK                             0x1
#define _CLBSWINL_CLBSWIN1_POSN                             0x1
#define _CLBSWINL_CLBSWIN1_POSITION                         0x1
#define _CLBSWINL_CLBSWIN1_SIZE                             0x1
#define _CLBSWINL_CLBSWIN1_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN1_MASK                             0x2
#define _CLBSWINL_CLBSWIN2_POSN                             0x2
#define _CLBSWINL_CLBSWIN2_POSITION                         0x2
#define _CLBSWINL_CLBSWIN2_SIZE                             0x1
#define _CLBSWINL_CLBSWIN2_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN2_MASK                             0x4
#define _CLBSWINL_CLBSWIN3_POSN                             0x3
#define _CLBSWINL_CLBSWIN3_POSITION                         0x3
#define _CLBSWINL_CLBSWIN3_SIZE                             0x1
#define _CLBSWINL_CLBSWIN3_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN3_MASK                             0x8
#define _CLBSWINL_CLBSWIN4_POSN                             0x4
#define _CLBSWINL_CLBSWIN4_POSITION                         0x4
#define _CLBSWINL_CLBSWIN4_SIZE                             0x1
#define _CLBSWINL_CLBSWIN4_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN4_MASK                             0x10
#define _CLBSWINL_CLBSWIN5_POSN                             0x5
#define _CLBSWINL_CLBSWIN5_POSITION                         0x5
#define _CLBSWINL_CLBSWIN5_SIZE                             0x1
#define _CLBSWINL_CLBSWIN5_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN5_MASK                             0x20
#define _CLBSWINL_CLBSWIN6_POSN                             0x6
#define _CLBSWINL_CLBSWIN6_POSITION                         0x6
#define _CLBSWINL_CLBSWIN6_SIZE                             0x1
#define _CLBSWINL_CLBSWIN6_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN6_MASK                             0x40
#define _CLBSWINL_CLBSWIN7_POSN                             0x7
#define _CLBSWINL_CLBSWIN7_POSITION                         0x7
#define _CLBSWINL_CLBSWIN7_SIZE                             0x1
#define _CLBSWINL_CLBSWIN7_LENGTH                           0x1
#define _CLBSWINL_CLBSWIN7_MASK                             0x80

