Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13145.h
extern volatile __bit                   CLB1IF0             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLB1IF0_bit         _BIT_ACCESS(PIR7,0)
// PIR7<CLB1IF1>
extern volatile __bit                   CLB1IF1             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLB1IF1_bit         _BIT_ACCESS(PIR7,1)
// PIR7<CLB1IF2>
extern volatile __bit                   CLB1IF2             __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLB1IF2_bit         _BIT_ACCESS(PIR7,2)
// PIR7<CLB1IF3>
extern volatile __bit                   CLB1IF3             __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLB1IF3_bit         _BIT_ACCESS(PIR7,3)
// CLBCON<CLBEN>
extern volatile __bit                   CLBEN               __at(0x2867);	// @ (0x50C * 8 + 7)
#define                                 CLBEN_bit           _BIT_ACCESS(CLBCON,7)
// PMD4<CLBMD>
extern volatile __bit                   CLBMD               __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 CLBMD_bit           _BIT_ACCESS(PMD4,7)
// CLBSWINL<CLBSWIN0>
extern volatile __bit                   CLBSWIN0            __at(0x2880);	// @ (0x510 * 8 + 0)
#define                                 CLBSWIN0_bit        _BIT_ACCESS(CLBSWINL,0)
// CLBSWINL<CLBSWIN1>
extern volatile __bit                   CLBSWIN1            __at(0x2881);	// @ (0x510 * 8 + 1)
#define                                 CLBSWIN1_bit        _BIT_ACCESS(CLBSWINL,1)
// CLBSWINM<CLBSWIN10>
extern volatile __bit                   CLBSWIN10           __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 CLBSWIN10_bit       _BIT_ACCESS(CLBSWINM,2)
// CLBSWINM<CLBSWIN11>
extern volatile __bit                   CLBSWIN11           __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 CLBSWIN11_bit       _BIT_ACCESS(CLBSWINM,3)
// CLBSWINM<CLBSWIN12>
extern volatile __bit                   CLBSWIN12           __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 CLBSWIN12_bit       _BIT_ACCESS(CLBSWINM,4)
// CLBSWINM<CLBSWIN13>
extern volatile __bit                   CLBSWIN13           __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 CLBSWIN13_bit       _BIT_ACCESS(CLBSWINM,5)
// CLBSWINM<CLBSWIN14>
extern volatile __bit                   CLBSWIN14           __at(0x287E);	// @ (0x50F * 8 + 6)
#define                                 CLBSWIN14_bit       _BIT_ACCESS(CLBSWINM,6)
// CLBSWINM<CLBSWIN15>
extern volatile __bit                   CLBSWIN15           __at(0x287F);	// @ (0x50F * 8 + 7)
#define                                 CLBSWIN15_bit       _BIT_ACCESS(CLBSWINM,7)
// CLBSWINH<CLBSWIN16>
extern volatile __bit                   CLBSWIN16           __at(0x2870);	// @ (0x50E * 8 + 0)
#define                                 CLBSWIN16_bit       _BIT_ACCESS(CLBSWINH,0)
// CLBSWINH<CLBSWIN17>
extern volatile __bit                   CLBSWIN17           __at(0x2871);	// @ (0x50E * 8 + 1)
#define                                 CLBSWIN17_bit       _BIT_ACCESS(CLBSWINH,1)
// CLBSWINH<CLBSWIN18>
extern volatile __bit                   CLBSWIN18           __at(0x2872);	// @ (0x50E * 8 + 2)
#define                                 CLBSWIN18_bit       _BIT_ACCESS(CLBSWINH,2)
// CLBSWINH<CLBSWIN19>
extern volatile __bit                   CLBSWIN19           __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 CLBSWIN19_bit       _BIT_ACCESS(CLBSWINH,3)
// CLBSWINL<CLBSWIN2>
extern volatile __bit                   CLBSWIN2            __at(0x2882);	// @ (0x510 * 8 + 2)
#define                                 CLBSWIN2_bit        _BIT_ACCESS(CLBSWINL,2)
// CLBSWINH<CLBSWIN20>
extern volatile __bit                   CLBSWIN20           __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 CLBSWIN20_bit       _BIT_ACCESS(CLBSWINH,4)
// CLBSWINH<CLBSWIN21>
extern volatile __bit                   CLBSWIN21           __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 CLBSWIN21_bit       _BIT_ACCESS(CLBSWINH,5)
// CLBSWINH<CLBSWIN22>
extern volatile __bit                   CLBSWIN22           __at(0x2876);	// @ (0x50E * 8 + 6)
#define                                 CLBSWIN22_bit       _BIT_ACCESS(CLBSWINH,6)
// CLBSWINH<CLBSWIN23>
extern volatile __bit                   CLBSWIN23           __at(0x2877);	// @ (0x50E * 8 + 7)
#define                                 CLBSWIN23_bit       _BIT_ACCESS(CLBSWINH,7)
// CLBSWINU<CLBSWIN24>
extern volatile __bit                   CLBSWIN24           __at(0x2868);	// @ (0x50D * 8 + 0)
#define                                 CLBSWIN24_bit       _BIT_ACCESS(CLBSWINU,0)
// CLBSWINU<CLBSWIN25>
extern volatile __bit                   CLBSWIN25           __at(0x2869);	// @ (0x50D * 8 + 1)
#define                                 CLBSWIN25_bit       _BIT_ACCESS(CLBSWINU,1)
// CLBSWINU<CLBSWIN26>
extern volatile __bit                   CLBSWIN26           __at(0x286A);	// @ (0x50D * 8 + 2)
#define                                 CLBSWIN26_bit       _BIT_ACCESS(CLBSWINU,2)
// CLBSWINU<CLBSWIN27>
extern volatile __bit                   CLBSWIN27           __at(0x286B);	// @ (0x50D * 8 + 3)
#define                                 CLBSWIN27_bit       _BIT_ACCESS(CLBSWINU,3)
// CLBSWINU<CLBSWIN28>
extern volatile __bit                   CLBSWIN28           __at(0x286C);	// @ (0x50D * 8 + 4)
#define                                 CLBSWIN28_bit       _BIT_ACCESS(CLBSWINU,4)
// CLBSWINU<CLBSWIN29>
extern volatile __bit                   CLBSWIN29           __at(0x286D);	// @ (0x50D * 8 + 5)
#define                                 CLBSWIN29_bit       _BIT_ACCESS(CLBSWINU,5)
// CLBSWINL<CLBSWIN3>
extern volatile __bit                   CLBSWIN3            __at(0x2883);	// @ (0x510 * 8 + 3)
#define                                 CLBSWIN3_bit        _BIT_ACCESS(CLBSWINL,3)
// CLBSWINU<CLBSWIN30>
extern volatile __bit                   CLBSWIN30           __at(0x286E);	// @ (0x50D * 8 + 6)
#define                                 CLBSWIN30_bit       _BIT_ACCESS(CLBSWINU,6)
// CLBSWINU<CLBSWIN31>
extern volatile __bit                   CLBSWIN31           __at(0x286F);	// @ (0x50D * 8 + 7)
#define                                 CLBSWIN31_bit       _BIT_ACCESS(CLBSWINU,7)
// CLBSWINL<CLBSWIN4>
extern volatile __bit                   CLBSWIN4            __at(0x2884);	// @ (0x510 * 8 + 4)
#define                                 CLBSWIN4_bit        _BIT_ACCESS(CLBSWINL,4)
// CLBSWINL<CLBSWIN5>
extern volatile __bit                   CLBSWIN5            __at(0x2885);	// @ (0x510 * 8 + 5)
#define                                 CLBSWIN5_bit        _BIT_ACCESS(CLBSWINL,5)
// CLBSWINL<CLBSWIN6>
extern volatile __bit                   CLBSWIN6            __at(0x2886);	// @ (0x510 * 8 + 6)
#define                                 CLBSWIN6_bit        _BIT_ACCESS(CLBSWINL,6)
// CLBSWINL<CLBSWIN7>
extern volatile __bit                   CLBSWIN7            __at(0x2887);	// @ (0x510 * 8 + 7)
#define                                 CLBSWIN7_bit        _BIT_ACCESS(CLBSWINL,7)
// CLBSWINM<CLBSWIN8>
extern volatile __bit                   CLBSWIN8            __at(0x2878);	// @ (0x50F * 8 + 0)
#define                                 CLBSWIN8_bit        _BIT_ACCESS(CLBSWINM,0)
// CLBSWINM<CLBSWIN9>
extern volatile __bit                   CLBSWIN9            __at(0x2879);	// @ (0x50F * 8 + 1)
#define                                 CLBSWIN9_bit        _BIT_ACCESS(CLBSWINM,1)
// PIE4<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR4,2)
// PMD2<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD2,5)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE4<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR4,3)
// PMD2<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD2,6)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE4<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR4,4)
// PMD2<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD2,7)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE4<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR4,5)
// PMD3<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD3,0)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0xF1E8);	// @ (0x1E3D * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0xF1E9);	// @ (0x1E3D * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0xF1EA);	// @ (0x1E3D * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0xF1EB);	// @ (0x1E3D * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0xF1EC);	// @ (0x1E3D * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0xF1F0);	// @ (0x1E3E * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0xF1F8);	// @ (0x1E3F * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0xF200);	// @ (0x1E40 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0xF201);	// @ (0x1E40 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0xF202);	// @ (0x1E40 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF203);	// @ (0x1E40 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF204);	// @ (0x1E40 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLBCLK<CLK0>
extern volatile __bit                   CLK0                __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 CLK0_bit            _BIT_ACCESS(CLBCLK,0)
// CLBCLK<CLK1>
extern volatile __bit                   CLK1                __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 CLK1_bit            _BIT_ACCESS(CLBCLK,1)
// CLBCLK<CLK2>
extern volatile __bit                   CLK2                __at(0x28AA);	// @ (0x515 * 8 + 2)
#define                                 CLK2_bit            _BIT_ACCESS(CLBCLK,2)
// CLBCLK<CLK3>
extern volatile __bit                   CLK3                __at(0x28AB);	// @ (0x515 * 8 + 3)
#define                                 CLK3_bit            _BIT_ACCESS(CLBCLK,3)
// PIE5<CM1IE>
extern volatile __bit                   CM1IE               __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE5,6)
// PIR5<CM1IF>
extern volatile __bit                   CM1IF               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR5,6)
// PMD3<CM1MD>
extern volatile __bit                   CM1MD               __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD3,6)
// PIE5<CM2IE>
extern volatile __bit                   CM2IE               __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE5,7)
// PIR5<CM2IF>
extern volatile __bit                   CM2IF               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR5,7)
// PMD3<CM2MD>
extern volatile __bit                   CM2MD               __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD3,7)
// ADCNT<CNT0>
extern volatile __bit                   CNT0                __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 CNT0_bit            _BIT_ACCESS(ADCNT,0)
// ADCNT<CNT1>
extern volatile __bit                   CNT1                __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 CNT1_bit            _BIT_ACCESS(ADCNT,1)
// ADCNT<CNT2>
extern volatile __bit                   CNT2                __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 CNT2_bit            _BIT_ACCESS(ADCNT,2)
// ADCNT<CNT3>
extern volatile __bit                   CNT3                __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 CNT3_bit            _BIT_ACCESS(ADCNT,3)
// ADCNT<CNT4>
extern volatile __bit                   CNT4                __at(0xE8CC);	// @ (0x1D19 * 8 + 4)
#define                                 CNT4_bit            _BIT_ACCESS(ADCNT,4)
// ADCNT<CNT5>
extern volatile __bit                   CNT5                __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 CNT5_bit            _BIT_ACCESS(ADCNT,5)
// ADCNT<CNT6>
extern volatile __bit                   CNT6                __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 CNT6_bit            _BIT_ACCESS(ADCNT,6)
// ADCNT<CNT7>
extern volatile __bit                   CNT7                __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 CNT7_bit            _BIT_ACCESS(ADCNT,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// T2HLT<CPOL>
extern volatile __bit                   CPOL                __at(0x1C7E);	// @ (0x38F * 8 + 6)
#define                                 CPOL_bit            _BIT_ACCESS(T2HLT,6)
// CPCON<CPOS>
extern volatile __bit                   CPOS                __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 CPOS_bit            _BIT_ACCESS(CPCON,5)
// CPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1068);	// @ (0x20D * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(CPCON,0)
// CPCON<CPREQ>
extern volatile __bit                   CPREQ               __at(0x106A);	// @ (0x20D * 8 + 2)
#define                                 CPREQ_bit           _BIT_ACCESS(CPCON,2)
// CPCON<CPT>
extern volatile __bit                   CPT                 __at(0x1069);	// @ (0x20D * 8 + 1)
#define                                 CPT_bit             _BIT_ACCESS(CPCON,1)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0xE52D);	// @ (0x1CA5 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0xE52F);	// @ (0x1CA5 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0xE52E);	// @ (0x1CA5 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE1<CRCIE>
extern volatile __bit                   CRCIE               __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<CRCIF>
extern volatile __bit                   CRCIF               __at(0x469);	// @ (0x8D * 8 + 1)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR1,1)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,1)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0x3884);	// @ (0x710 * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0xE944);	// @ (0x1D28 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0xE945);	// @ (0x1D28 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0xE946);	// @ (0x1D28 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCON0<CS>
extern volatile __bit                   CS                  __at(0xE934);	// @ (0x1D26 * 8 + 4)
#define                                 CS_bit              _BIT_ACCESS(ADCON0,4)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0xE96D);	// @ (0x1D2D * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0x388F);	// @ (0x711 * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x147F);	// @ (0x28F * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE1<CSWIE>
extern volatile __bit                   CSWIE               __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<CSWIF>
extern volatile __bit                   CSWIF               __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR1,4)
// T2HLT<CSYNC>
extern volatile __bit                   CSYNC               __at(0x1C7D);	// @ (0x38F * 8 + 5)
#define                                 CSYNC_bit           _BIT_ACCESS(T2HLT,5)
// CLCnSEL0<D1S0>
extern volatile __bit                   D1S0                __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLCnSEL0,0)
// CLCnSEL0<D1S1>
extern volatile __bit                   D1S1                __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLCnSEL0,1)
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0x3473);	// @ (0x68E * 8 + 3)
